using System.Collections.Generic;

namespace Mofi
{
    internal static class Data
    {
        public static readonly IDictionary<ushort, string> S = new SortedDictionary<ushort, string>
        {
            { 2969, "[S] 아그리파" },
            { 2965, "[S] 보나콘" },
            { 2958, "[S] 브론테스" },
            { 2963, "[S] 개굴개로스" },
            { 2962, "[S] 크로크 미테느" },
            { 2964, "[S] 갈록" },
            { 2953, "[S] 레드로네트" },
            { 2959, "[S] 발라우르" },
            { 2967, "[S] 체르노보그" },
            { 31,   "[S] 정신지배자" },
            { 2961, "[S] 미뇨카온" },
            { 2966, "[S] 난디" },
            { 558,  "[S] 느뉴느위" },
            { 2968, "[S] 사파트" },
            { 2956, "[S] 천갈래덩굴 세다" },
            { 2954, "[S] 울가루" },
            { 2957, "[S] 조나 시커" },
	
            { 4377, "[S] 간다르바" },
            { 4375, "[S] 센무르" },
            { 4376, "[S] 창백의 기수" },
            { 4380, "[S] 레우크로타" },

            { 405, "꼬마 만드라고라" },
        };

        public static readonly IDictionary<ushort, string> A = new SortedDictionary<ushort, string>
        {
            { 2940, "[A] 알렉트리온" },
            { 2950, "[A] 콘누" },
            { 2944, "[A] 마지막 투혼" },
            { 2936, "[A] 포르네우스" },
            { 2938, "[A] 게데" },
            { 2939, "[A] 기르타브" },
            { 2947, "[A] 마도 지옥손아귀" },
            { 2952, "[A] 쿠레아" },
            { 2942, "[A] 마헤스" },
            { 2949, "[A] 마베리" },
            { 2951, "[A] 머라쿠" },
            { 2937, "[A] 녹아내리는 젤리" },
            { 2948, "[A] 난" },
            { 2946, "[A] 웅크테히" },
            { 2945, "[A] 못생긴 보가쟈" },
            { 2941, "[A] 사보텐더 무희" },
            { 2943, "[A] 자니고" },
	
            { 4363, "[A] 류바" },
            { 4362, "[A] 미르카" },
            { 4369, "[A] 아가토스" },
            { 4368, "[A] 부네" },
            { 4365, "[A] 와이번 로드" },
            { 4364, "[A] 파일라스터" },
            { 4367, "[A] 스톨라스" },
            { 4366, "[A] 기계병정 슬립킨크스" },
            { 4371, "[A] 시시우틀" },
            { 4370, "[A] 엔켈라도스" },
            { 4373, "[A] 악취화" },
            { 4372, "[A] 캠파크티" },
        };

        public static readonly IDictionary<ushort, string> B = new SortedDictionary<ushort, string>
        {
            { 2926, "[B] 잿빛낯 알빈" },
            { 2929, "[B] 바바스텔" },
            { 2930, "[B] 핏빛 메리" },
            { 2931, "[B] 검은 투구게" },
            { 2927, "[B] 불멸의 중사 페란드" },
            { 2925, "[B] 개틀링" },
            { 2935, "[B] 대왕거머리" },
            { 2921, "[B] 제왕잠자리" },
            { 2932, "[B] 미라드로시" },
            { 2934, "[B] 나울" },
            { 2924, "[B] 아브젱" },
            { 2922, "[B] 페크다" },
            { 2923, "[B] 하수도 시럽" },
            { 2928, "[B] 스콕스프루" },
            { 2920, "[B] 따끔한 소피" },
            { 2933, "[B] 부오코" },
            { 2919, "[B] 흰재간둥이" },
	
            { 4351, "[B] 크루제" },
            { 4350, "[B] 알티크" },
            { 4357, "[B] 허수아비전갈" },
            { 4356, "[B] 스키탈리스" },
            { 4353, "[B] 텍스타" },
            { 4352, "[B] 그나스 혜성요격자" },
            { 4354, "[B] 프테리고투스" },
            { 4355, "[B] 기간토피테쿠스" },
            { 4359, "[B] 무용수 사누발리" },
            { 4358, "[B] 스퀑크" },
            { 4361, "[B] 옴니" },
            { 4360, "[B] 류키다스" },
        };
    }
}
